app/controllers/locations_controller.rb

SELECT `locations`.* FROM `locations`
---
  def index
   @locations = Location.all

SELECT *, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((17.4563 - latitude) * PI() / 180 / 2), 2) + COS(17.4563 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((78.4255 - longitude) * PI() / 180 / 2), 2) )) AS distance, CAST(DEGREES(ATAN2( RADIANS(longitude - 78.4255), RADIANS(latitude - 17.4563))) + 360 AS decimal) % 360 AS bearing FROM `locations` WHERE (latitude BETWEEN 17.383934108444574 AND 17.528665891555423 AND longitude BETWEEN 78.34964047575934 AND 78.50135952424066 AND locations.id != 1) GROUP BY locations.id,locations.name,locations.address,locations.longitude,locations.latitude,locations.gmaps,locations.created_at,locations.updated_at HAVING 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((17.4563 - latitude) * PI() / 180 / 2), 2) + COS(17.4563 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((78.4255 - longitude) * PI() / 180 / 2), 2) )) <= 5 ORDER BY 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((17.4563 - latitude) * PI() / 180 / 2), 2) + COS(17.4563 * PI() / 180) * COS(latitude * PI() / 180) * POWER(SIN((78.4255 - longitude) * PI() / 180 / 2), 2) )) ASC
---
  def show
     @location = Location.find(params[:id])

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 3 LIMIT 1
---
  def edit
    @location = Location.find(params[:id])

INSERT INTO `locations` (`address`, `created_at`, `gmaps`, `latitude`, `longitude`, `name`, `updated_at`) VALUES ('errgadda,busstop', '2012-12-17 13:37:59', 1, 17.4563443, 78.42553199999999, 'errgadda,busstop', '2012-12-17 13:37:59')
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 3 LIMIT 1
---
  def update
    @location = Location.find(params[:id])